#+TITLE: Emacs Config 
#+STARTUP: overview


* Vertico
#+begin_src emacs-lisp 
  (use-package vertico
    :ensure t
    :init
    (vertico-mode 1))
#+end_src

#+RESULTS:
: [nil 27152 243 854932 nil elpaca-process-queues nil nil 61000 nil]

* Orderless (fuzzy search engine)
#+begin_src emacs-lisp
  (use-package orderless
    :ensure t
    :custom
    (completion-styles '(orderless basic))
    (completion-category-overrides '((file (styles basic partial-completion)))))
#+end_src

#+RESULTS:
: [nil 27152 363 476981 nil elpaca-process-queues nil nil 910000 nil]

